set sdc_version 1.9


# ****************************************************
# coreConsultant generated intent command file for design: DW_axi
# Generator version: 2.0
# Generated at: 11:21:40 on 08/06/18
# ****************************************************
# Clock waveform definitions and synthesis directives.
create_clock [get_ports {aclk}] -name aclk -period 4 -waveform {0 2} 
set_clock_uncertainty 0 [get_clocks {aclk}] 
set_clock_latency 0 [get_clocks {aclk}] 
set_clock_latency -source 0 [get_clocks {aclk}]
# Minimum/Maximum delay values (arrival times) for input ports.
set_input_delay -add_delay -max 0 -clock aclk [get_ports {aresetn}]
set_input_delay -add_delay -min 0 -clock aclk [get_ports {aresetn}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_m1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_m1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s1}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s1}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s2}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s2}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s3}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s3}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s4}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s4}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s5}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s5}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s6}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s6}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_s7}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_s7}]
set_input_delay -add_delay -max 0.8 -clock aclk [get_ports {remap_n}]
set_input_delay -add_delay -min 0.8 -clock aclk [get_ports {remap_n}]
# Minimum/Maximum delay values (external required times) for output ports.
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awready_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awready_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wready_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wready_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bvalid_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bvalid_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bid_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bid_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bresp_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bresp_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arready_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arready_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rvalid_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rvalid_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rid_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rid_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rdata_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rdata_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rresp_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rresp_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rlast_m1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rlast_m1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s1}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s1}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s2}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s2}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s3}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s3}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s4}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s4}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s5}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s5}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s6}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s6}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awvalid_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awvalid_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awaddr_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awaddr_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awid_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awid_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlen_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlen_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awsize_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awsize_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awburst_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awburst_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awlock_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awlock_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awcache_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awcache_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {awprot_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {awprot_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wvalid_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wvalid_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wid_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wid_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wdata_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wdata_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wstrb_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wstrb_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {wlast_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {wlast_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {bready_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {bready_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arvalid_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arvalid_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arid_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arid_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {araddr_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {araddr_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlen_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlen_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arsize_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arsize_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arburst_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arburst_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arlock_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arlock_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arcache_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arcache_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {arprot_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {arprot_s7}]
set_output_delay -add_delay -max 0.8 -clock aclk [get_ports {rready_s7}]
set_output_delay -add_delay -min 0.8 -clock aclk [get_ports {rready_s7}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awaddr_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awaddr_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awlen_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awlen_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awsize_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awsize_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awburst_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awburst_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awlock_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awlock_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awcache_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awcache_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awprot_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awprot_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awvalid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awvalid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_awready_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_awready_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_wid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_wid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_wdata_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_wdata_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_wstrb_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_wstrb_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_wlast_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_wlast_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_wvalid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_wvalid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_wready_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_wready_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_bid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_bid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_bresp_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_bresp_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_bvalid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_bvalid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_bready_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_bready_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_araddr_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_araddr_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arlen_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arlen_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arsize_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arsize_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arburst_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arburst_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arlock_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arlock_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arcache_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arcache_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arprot_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arprot_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arvalid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arvalid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_arready_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_arready_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_rid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_rid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_rdata_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_rdata_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_rresp_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_rresp_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_rvalid_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_rvalid_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_rlast_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_rlast_s0}]
set_output_delay -add_delay -max 0.4 -clock aclk [get_ports {dbg_rready_s0}]
set_output_delay -add_delay -min 0.4 -clock aclk [get_ports {dbg_rready_s0}]
# Estimated loads seen externally by ports.
set_load -pin_load 3 [get_ports {awready_m1}]
set_port_fanout_number 3 [get_ports {awready_m1}]
set_load -pin_load 3 [get_ports {wready_m1}]
set_port_fanout_number 3 [get_ports {wready_m1}]
set_load -pin_load 3 [get_ports {bvalid_m1}]
set_port_fanout_number 3 [get_ports {bvalid_m1}]
set_load -pin_load 3 [get_ports {bid_m1}]
set_port_fanout_number 3 [get_ports {bid_m1}]
set_load -pin_load 3 [get_ports {bresp_m1}]
set_port_fanout_number 3 [get_ports {bresp_m1}]
set_load -pin_load 3 [get_ports {arready_m1}]
set_port_fanout_number 3 [get_ports {arready_m1}]
set_load -pin_load 3 [get_ports {rvalid_m1}]
set_port_fanout_number 3 [get_ports {rvalid_m1}]
set_load -pin_load 3 [get_ports {rid_m1}]
set_port_fanout_number 3 [get_ports {rid_m1}]
set_load -pin_load 3 [get_ports {rdata_m1}]
set_port_fanout_number 3 [get_ports {rdata_m1}]
set_load -pin_load 3 [get_ports {rresp_m1}]
set_port_fanout_number 3 [get_ports {rresp_m1}]
set_load -pin_load 3 [get_ports {rlast_m1}]
set_port_fanout_number 3 [get_ports {rlast_m1}]
set_load -pin_load 3 [get_ports {awvalid_s1}]
set_port_fanout_number 3 [get_ports {awvalid_s1}]
set_load -pin_load 3 [get_ports {awaddr_s1}]
set_port_fanout_number 3 [get_ports {awaddr_s1}]
set_load -pin_load 3 [get_ports {awid_s1}]
set_port_fanout_number 3 [get_ports {awid_s1}]
set_load -pin_load 3 [get_ports {awlen_s1}]
set_port_fanout_number 3 [get_ports {awlen_s1}]
set_load -pin_load 3 [get_ports {awsize_s1}]
set_port_fanout_number 3 [get_ports {awsize_s1}]
set_load -pin_load 3 [get_ports {awburst_s1}]
set_port_fanout_number 3 [get_ports {awburst_s1}]
set_load -pin_load 3 [get_ports {awlock_s1}]
set_port_fanout_number 3 [get_ports {awlock_s1}]
set_load -pin_load 3 [get_ports {awcache_s1}]
set_port_fanout_number 3 [get_ports {awcache_s1}]
set_load -pin_load 3 [get_ports {awprot_s1}]
set_port_fanout_number 3 [get_ports {awprot_s1}]
set_load -pin_load 3 [get_ports {wvalid_s1}]
set_port_fanout_number 3 [get_ports {wvalid_s1}]
set_load -pin_load 3 [get_ports {wid_s1}]
set_port_fanout_number 3 [get_ports {wid_s1}]
set_load -pin_load 3 [get_ports {wdata_s1}]
set_port_fanout_number 3 [get_ports {wdata_s1}]
set_load -pin_load 3 [get_ports {wstrb_s1}]
set_port_fanout_number 3 [get_ports {wstrb_s1}]
set_load -pin_load 3 [get_ports {wlast_s1}]
set_port_fanout_number 3 [get_ports {wlast_s1}]
set_load -pin_load 3 [get_ports {bready_s1}]
set_port_fanout_number 3 [get_ports {bready_s1}]
set_load -pin_load 3 [get_ports {arvalid_s1}]
set_port_fanout_number 3 [get_ports {arvalid_s1}]
set_load -pin_load 3 [get_ports {arid_s1}]
set_port_fanout_number 3 [get_ports {arid_s1}]
set_load -pin_load 3 [get_ports {araddr_s1}]
set_port_fanout_number 3 [get_ports {araddr_s1}]
set_load -pin_load 3 [get_ports {arlen_s1}]
set_port_fanout_number 3 [get_ports {arlen_s1}]
set_load -pin_load 3 [get_ports {arsize_s1}]
set_port_fanout_number 3 [get_ports {arsize_s1}]
set_load -pin_load 3 [get_ports {arburst_s1}]
set_port_fanout_number 3 [get_ports {arburst_s1}]
set_load -pin_load 3 [get_ports {arlock_s1}]
set_port_fanout_number 3 [get_ports {arlock_s1}]
set_load -pin_load 3 [get_ports {arcache_s1}]
set_port_fanout_number 3 [get_ports {arcache_s1}]
set_load -pin_load 3 [get_ports {arprot_s1}]
set_port_fanout_number 3 [get_ports {arprot_s1}]
set_load -pin_load 3 [get_ports {rready_s1}]
set_port_fanout_number 3 [get_ports {rready_s1}]
set_load -pin_load 3 [get_ports {awvalid_s2}]
set_port_fanout_number 3 [get_ports {awvalid_s2}]
set_load -pin_load 3 [get_ports {awaddr_s2}]
set_port_fanout_number 3 [get_ports {awaddr_s2}]
set_load -pin_load 3 [get_ports {awid_s2}]
set_port_fanout_number 3 [get_ports {awid_s2}]
set_load -pin_load 3 [get_ports {awlen_s2}]
set_port_fanout_number 3 [get_ports {awlen_s2}]
set_load -pin_load 3 [get_ports {awsize_s2}]
set_port_fanout_number 3 [get_ports {awsize_s2}]
set_load -pin_load 3 [get_ports {awburst_s2}]
set_port_fanout_number 3 [get_ports {awburst_s2}]
set_load -pin_load 3 [get_ports {awlock_s2}]
set_port_fanout_number 3 [get_ports {awlock_s2}]
set_load -pin_load 3 [get_ports {awcache_s2}]
set_port_fanout_number 3 [get_ports {awcache_s2}]
set_load -pin_load 3 [get_ports {awprot_s2}]
set_port_fanout_number 3 [get_ports {awprot_s2}]
set_load -pin_load 3 [get_ports {wvalid_s2}]
set_port_fanout_number 3 [get_ports {wvalid_s2}]
set_load -pin_load 3 [get_ports {wid_s2}]
set_port_fanout_number 3 [get_ports {wid_s2}]
set_load -pin_load 3 [get_ports {wdata_s2}]
set_port_fanout_number 3 [get_ports {wdata_s2}]
set_load -pin_load 3 [get_ports {wstrb_s2}]
set_port_fanout_number 3 [get_ports {wstrb_s2}]
set_load -pin_load 3 [get_ports {wlast_s2}]
set_port_fanout_number 3 [get_ports {wlast_s2}]
set_load -pin_load 3 [get_ports {bready_s2}]
set_port_fanout_number 3 [get_ports {bready_s2}]
set_load -pin_load 3 [get_ports {arvalid_s2}]
set_port_fanout_number 3 [get_ports {arvalid_s2}]
set_load -pin_load 3 [get_ports {arid_s2}]
set_port_fanout_number 3 [get_ports {arid_s2}]
set_load -pin_load 3 [get_ports {araddr_s2}]
set_port_fanout_number 3 [get_ports {araddr_s2}]
set_load -pin_load 3 [get_ports {arlen_s2}]
set_port_fanout_number 3 [get_ports {arlen_s2}]
set_load -pin_load 3 [get_ports {arsize_s2}]
set_port_fanout_number 3 [get_ports {arsize_s2}]
set_load -pin_load 3 [get_ports {arburst_s2}]
set_port_fanout_number 3 [get_ports {arburst_s2}]
set_load -pin_load 3 [get_ports {arlock_s2}]
set_port_fanout_number 3 [get_ports {arlock_s2}]
set_load -pin_load 3 [get_ports {arcache_s2}]
set_port_fanout_number 3 [get_ports {arcache_s2}]
set_load -pin_load 3 [get_ports {arprot_s2}]
set_port_fanout_number 3 [get_ports {arprot_s2}]
set_load -pin_load 3 [get_ports {rready_s2}]
set_port_fanout_number 3 [get_ports {rready_s2}]
set_load -pin_load 3 [get_ports {awvalid_s3}]
set_port_fanout_number 3 [get_ports {awvalid_s3}]
set_load -pin_load 3 [get_ports {awaddr_s3}]
set_port_fanout_number 3 [get_ports {awaddr_s3}]
set_load -pin_load 3 [get_ports {awid_s3}]
set_port_fanout_number 3 [get_ports {awid_s3}]
set_load -pin_load 3 [get_ports {awlen_s3}]
set_port_fanout_number 3 [get_ports {awlen_s3}]
set_load -pin_load 3 [get_ports {awsize_s3}]
set_port_fanout_number 3 [get_ports {awsize_s3}]
set_load -pin_load 3 [get_ports {awburst_s3}]
set_port_fanout_number 3 [get_ports {awburst_s3}]
set_load -pin_load 3 [get_ports {awlock_s3}]
set_port_fanout_number 3 [get_ports {awlock_s3}]
set_load -pin_load 3 [get_ports {awcache_s3}]
set_port_fanout_number 3 [get_ports {awcache_s3}]
set_load -pin_load 3 [get_ports {awprot_s3}]
set_port_fanout_number 3 [get_ports {awprot_s3}]
set_load -pin_load 3 [get_ports {wvalid_s3}]
set_port_fanout_number 3 [get_ports {wvalid_s3}]
set_load -pin_load 3 [get_ports {wid_s3}]
set_port_fanout_number 3 [get_ports {wid_s3}]
set_load -pin_load 3 [get_ports {wdata_s3}]
set_port_fanout_number 3 [get_ports {wdata_s3}]
set_load -pin_load 3 [get_ports {wstrb_s3}]
set_port_fanout_number 3 [get_ports {wstrb_s3}]
set_load -pin_load 3 [get_ports {wlast_s3}]
set_port_fanout_number 3 [get_ports {wlast_s3}]
set_load -pin_load 3 [get_ports {bready_s3}]
set_port_fanout_number 3 [get_ports {bready_s3}]
set_load -pin_load 3 [get_ports {arvalid_s3}]
set_port_fanout_number 3 [get_ports {arvalid_s3}]
set_load -pin_load 3 [get_ports {arid_s3}]
set_port_fanout_number 3 [get_ports {arid_s3}]
set_load -pin_load 3 [get_ports {araddr_s3}]
set_port_fanout_number 3 [get_ports {araddr_s3}]
set_load -pin_load 3 [get_ports {arlen_s3}]
set_port_fanout_number 3 [get_ports {arlen_s3}]
set_load -pin_load 3 [get_ports {arsize_s3}]
set_port_fanout_number 3 [get_ports {arsize_s3}]
set_load -pin_load 3 [get_ports {arburst_s3}]
set_port_fanout_number 3 [get_ports {arburst_s3}]
set_load -pin_load 3 [get_ports {arlock_s3}]
set_port_fanout_number 3 [get_ports {arlock_s3}]
set_load -pin_load 3 [get_ports {arcache_s3}]
set_port_fanout_number 3 [get_ports {arcache_s3}]
set_load -pin_load 3 [get_ports {arprot_s3}]
set_port_fanout_number 3 [get_ports {arprot_s3}]
set_load -pin_load 3 [get_ports {rready_s3}]
set_port_fanout_number 3 [get_ports {rready_s3}]
set_load -pin_load 3 [get_ports {awvalid_s4}]
set_port_fanout_number 3 [get_ports {awvalid_s4}]
set_load -pin_load 3 [get_ports {awaddr_s4}]
set_port_fanout_number 3 [get_ports {awaddr_s4}]
set_load -pin_load 3 [get_ports {awid_s4}]
set_port_fanout_number 3 [get_ports {awid_s4}]
set_load -pin_load 3 [get_ports {awlen_s4}]
set_port_fanout_number 3 [get_ports {awlen_s4}]
set_load -pin_load 3 [get_ports {awsize_s4}]
set_port_fanout_number 3 [get_ports {awsize_s4}]
set_load -pin_load 3 [get_ports {awburst_s4}]
set_port_fanout_number 3 [get_ports {awburst_s4}]
set_load -pin_load 3 [get_ports {awlock_s4}]
set_port_fanout_number 3 [get_ports {awlock_s4}]
set_load -pin_load 3 [get_ports {awcache_s4}]
set_port_fanout_number 3 [get_ports {awcache_s4}]
set_load -pin_load 3 [get_ports {awprot_s4}]
set_port_fanout_number 3 [get_ports {awprot_s4}]
set_load -pin_load 3 [get_ports {wvalid_s4}]
set_port_fanout_number 3 [get_ports {wvalid_s4}]
set_load -pin_load 3 [get_ports {wid_s4}]
set_port_fanout_number 3 [get_ports {wid_s4}]
set_load -pin_load 3 [get_ports {wdata_s4}]
set_port_fanout_number 3 [get_ports {wdata_s4}]
set_load -pin_load 3 [get_ports {wstrb_s4}]
set_port_fanout_number 3 [get_ports {wstrb_s4}]
set_load -pin_load 3 [get_ports {wlast_s4}]
set_port_fanout_number 3 [get_ports {wlast_s4}]
set_load -pin_load 3 [get_ports {bready_s4}]
set_port_fanout_number 3 [get_ports {bready_s4}]
set_load -pin_load 3 [get_ports {arvalid_s4}]
set_port_fanout_number 3 [get_ports {arvalid_s4}]
set_load -pin_load 3 [get_ports {arid_s4}]
set_port_fanout_number 3 [get_ports {arid_s4}]
set_load -pin_load 3 [get_ports {araddr_s4}]
set_port_fanout_number 3 [get_ports {araddr_s4}]
set_load -pin_load 3 [get_ports {arlen_s4}]
set_port_fanout_number 3 [get_ports {arlen_s4}]
set_load -pin_load 3 [get_ports {arsize_s4}]
set_port_fanout_number 3 [get_ports {arsize_s4}]
set_load -pin_load 3 [get_ports {arburst_s4}]
set_port_fanout_number 3 [get_ports {arburst_s4}]
set_load -pin_load 3 [get_ports {arlock_s4}]
set_port_fanout_number 3 [get_ports {arlock_s4}]
set_load -pin_load 3 [get_ports {arcache_s4}]
set_port_fanout_number 3 [get_ports {arcache_s4}]
set_load -pin_load 3 [get_ports {arprot_s4}]
set_port_fanout_number 3 [get_ports {arprot_s4}]
set_load -pin_load 3 [get_ports {rready_s4}]
set_port_fanout_number 3 [get_ports {rready_s4}]
set_load -pin_load 3 [get_ports {awvalid_s5}]
set_port_fanout_number 3 [get_ports {awvalid_s5}]
set_load -pin_load 3 [get_ports {awaddr_s5}]
set_port_fanout_number 3 [get_ports {awaddr_s5}]
set_load -pin_load 3 [get_ports {awid_s5}]
set_port_fanout_number 3 [get_ports {awid_s5}]
set_load -pin_load 3 [get_ports {awlen_s5}]
set_port_fanout_number 3 [get_ports {awlen_s5}]
set_load -pin_load 3 [get_ports {awsize_s5}]
set_port_fanout_number 3 [get_ports {awsize_s5}]
set_load -pin_load 3 [get_ports {awburst_s5}]
set_port_fanout_number 3 [get_ports {awburst_s5}]
set_load -pin_load 3 [get_ports {awlock_s5}]
set_port_fanout_number 3 [get_ports {awlock_s5}]
set_load -pin_load 3 [get_ports {awcache_s5}]
set_port_fanout_number 3 [get_ports {awcache_s5}]
set_load -pin_load 3 [get_ports {awprot_s5}]
set_port_fanout_number 3 [get_ports {awprot_s5}]
set_load -pin_load 3 [get_ports {wvalid_s5}]
set_port_fanout_number 3 [get_ports {wvalid_s5}]
set_load -pin_load 3 [get_ports {wid_s5}]
set_port_fanout_number 3 [get_ports {wid_s5}]
set_load -pin_load 3 [get_ports {wdata_s5}]
set_port_fanout_number 3 [get_ports {wdata_s5}]
set_load -pin_load 3 [get_ports {wstrb_s5}]
set_port_fanout_number 3 [get_ports {wstrb_s5}]
set_load -pin_load 3 [get_ports {wlast_s5}]
set_port_fanout_number 3 [get_ports {wlast_s5}]
set_load -pin_load 3 [get_ports {bready_s5}]
set_port_fanout_number 3 [get_ports {bready_s5}]
set_load -pin_load 3 [get_ports {arvalid_s5}]
set_port_fanout_number 3 [get_ports {arvalid_s5}]
set_load -pin_load 3 [get_ports {arid_s5}]
set_port_fanout_number 3 [get_ports {arid_s5}]
set_load -pin_load 3 [get_ports {araddr_s5}]
set_port_fanout_number 3 [get_ports {araddr_s5}]
set_load -pin_load 3 [get_ports {arlen_s5}]
set_port_fanout_number 3 [get_ports {arlen_s5}]
set_load -pin_load 3 [get_ports {arsize_s5}]
set_port_fanout_number 3 [get_ports {arsize_s5}]
set_load -pin_load 3 [get_ports {arburst_s5}]
set_port_fanout_number 3 [get_ports {arburst_s5}]
set_load -pin_load 3 [get_ports {arlock_s5}]
set_port_fanout_number 3 [get_ports {arlock_s5}]
set_load -pin_load 3 [get_ports {arcache_s5}]
set_port_fanout_number 3 [get_ports {arcache_s5}]
set_load -pin_load 3 [get_ports {arprot_s5}]
set_port_fanout_number 3 [get_ports {arprot_s5}]
set_load -pin_load 3 [get_ports {rready_s5}]
set_port_fanout_number 3 [get_ports {rready_s5}]
set_load -pin_load 3 [get_ports {awvalid_s6}]
set_port_fanout_number 3 [get_ports {awvalid_s6}]
set_load -pin_load 3 [get_ports {awaddr_s6}]
set_port_fanout_number 3 [get_ports {awaddr_s6}]
set_load -pin_load 3 [get_ports {awid_s6}]
set_port_fanout_number 3 [get_ports {awid_s6}]
set_load -pin_load 3 [get_ports {awlen_s6}]
set_port_fanout_number 3 [get_ports {awlen_s6}]
set_load -pin_load 3 [get_ports {awsize_s6}]
set_port_fanout_number 3 [get_ports {awsize_s6}]
set_load -pin_load 3 [get_ports {awburst_s6}]
set_port_fanout_number 3 [get_ports {awburst_s6}]
set_load -pin_load 3 [get_ports {awlock_s6}]
set_port_fanout_number 3 [get_ports {awlock_s6}]
set_load -pin_load 3 [get_ports {awcache_s6}]
set_port_fanout_number 3 [get_ports {awcache_s6}]
set_load -pin_load 3 [get_ports {awprot_s6}]
set_port_fanout_number 3 [get_ports {awprot_s6}]
set_load -pin_load 3 [get_ports {wvalid_s6}]
set_port_fanout_number 3 [get_ports {wvalid_s6}]
set_load -pin_load 3 [get_ports {wid_s6}]
set_port_fanout_number 3 [get_ports {wid_s6}]
set_load -pin_load 3 [get_ports {wdata_s6}]
set_port_fanout_number 3 [get_ports {wdata_s6}]
set_load -pin_load 3 [get_ports {wstrb_s6}]
set_port_fanout_number 3 [get_ports {wstrb_s6}]
set_load -pin_load 3 [get_ports {wlast_s6}]
set_port_fanout_number 3 [get_ports {wlast_s6}]
set_load -pin_load 3 [get_ports {bready_s6}]
set_port_fanout_number 3 [get_ports {bready_s6}]
set_load -pin_load 3 [get_ports {arvalid_s6}]
set_port_fanout_number 3 [get_ports {arvalid_s6}]
set_load -pin_load 3 [get_ports {arid_s6}]
set_port_fanout_number 3 [get_ports {arid_s6}]
set_load -pin_load 3 [get_ports {araddr_s6}]
set_port_fanout_number 3 [get_ports {araddr_s6}]
set_load -pin_load 3 [get_ports {arlen_s6}]
set_port_fanout_number 3 [get_ports {arlen_s6}]
set_load -pin_load 3 [get_ports {arsize_s6}]
set_port_fanout_number 3 [get_ports {arsize_s6}]
set_load -pin_load 3 [get_ports {arburst_s6}]
set_port_fanout_number 3 [get_ports {arburst_s6}]
set_load -pin_load 3 [get_ports {arlock_s6}]
set_port_fanout_number 3 [get_ports {arlock_s6}]
set_load -pin_load 3 [get_ports {arcache_s6}]
set_port_fanout_number 3 [get_ports {arcache_s6}]
set_load -pin_load 3 [get_ports {arprot_s6}]
set_port_fanout_number 3 [get_ports {arprot_s6}]
set_load -pin_load 3 [get_ports {rready_s6}]
set_port_fanout_number 3 [get_ports {rready_s6}]
set_load -pin_load 3 [get_ports {awvalid_s7}]
set_port_fanout_number 3 [get_ports {awvalid_s7}]
set_load -pin_load 3 [get_ports {awaddr_s7}]
set_port_fanout_number 3 [get_ports {awaddr_s7}]
set_load -pin_load 3 [get_ports {awid_s7}]
set_port_fanout_number 3 [get_ports {awid_s7}]
set_load -pin_load 3 [get_ports {awlen_s7}]
set_port_fanout_number 3 [get_ports {awlen_s7}]
set_load -pin_load 3 [get_ports {awsize_s7}]
set_port_fanout_number 3 [get_ports {awsize_s7}]
set_load -pin_load 3 [get_ports {awburst_s7}]
set_port_fanout_number 3 [get_ports {awburst_s7}]
set_load -pin_load 3 [get_ports {awlock_s7}]
set_port_fanout_number 3 [get_ports {awlock_s7}]
set_load -pin_load 3 [get_ports {awcache_s7}]
set_port_fanout_number 3 [get_ports {awcache_s7}]
set_load -pin_load 3 [get_ports {awprot_s7}]
set_port_fanout_number 3 [get_ports {awprot_s7}]
set_load -pin_load 3 [get_ports {wvalid_s7}]
set_port_fanout_number 3 [get_ports {wvalid_s7}]
set_load -pin_load 3 [get_ports {wid_s7}]
set_port_fanout_number 3 [get_ports {wid_s7}]
set_load -pin_load 3 [get_ports {wdata_s7}]
set_port_fanout_number 3 [get_ports {wdata_s7}]
set_load -pin_load 3 [get_ports {wstrb_s7}]
set_port_fanout_number 3 [get_ports {wstrb_s7}]
set_load -pin_load 3 [get_ports {wlast_s7}]
set_port_fanout_number 3 [get_ports {wlast_s7}]
set_load -pin_load 3 [get_ports {bready_s7}]
set_port_fanout_number 3 [get_ports {bready_s7}]
set_load -pin_load 3 [get_ports {arvalid_s7}]
set_port_fanout_number 3 [get_ports {arvalid_s7}]
set_load -pin_load 3 [get_ports {arid_s7}]
set_port_fanout_number 3 [get_ports {arid_s7}]
set_load -pin_load 3 [get_ports {araddr_s7}]
set_port_fanout_number 3 [get_ports {araddr_s7}]
set_load -pin_load 3 [get_ports {arlen_s7}]
set_port_fanout_number 3 [get_ports {arlen_s7}]
set_load -pin_load 3 [get_ports {arsize_s7}]
set_port_fanout_number 3 [get_ports {arsize_s7}]
set_load -pin_load 3 [get_ports {arburst_s7}]
set_port_fanout_number 3 [get_ports {arburst_s7}]
set_load -pin_load 3 [get_ports {arlock_s7}]
set_port_fanout_number 3 [get_ports {arlock_s7}]
set_load -pin_load 3 [get_ports {arcache_s7}]
set_port_fanout_number 3 [get_ports {arcache_s7}]
set_load -pin_load 3 [get_ports {arprot_s7}]
set_port_fanout_number 3 [get_ports {arprot_s7}]
set_load -pin_load 3 [get_ports {rready_s7}]
set_port_fanout_number 3 [get_ports {rready_s7}]
set_load -pin_load 3 [get_ports {dbg_awid_s0}]
set_port_fanout_number 3 [get_ports {dbg_awid_s0}]
set_load -pin_load 3 [get_ports {dbg_awaddr_s0}]
set_port_fanout_number 3 [get_ports {dbg_awaddr_s0}]
set_load -pin_load 3 [get_ports {dbg_awlen_s0}]
set_port_fanout_number 3 [get_ports {dbg_awlen_s0}]
set_load -pin_load 3 [get_ports {dbg_awsize_s0}]
set_port_fanout_number 3 [get_ports {dbg_awsize_s0}]
set_load -pin_load 3 [get_ports {dbg_awburst_s0}]
set_port_fanout_number 3 [get_ports {dbg_awburst_s0}]
set_load -pin_load 3 [get_ports {dbg_awlock_s0}]
set_port_fanout_number 3 [get_ports {dbg_awlock_s0}]
set_load -pin_load 3 [get_ports {dbg_awcache_s0}]
set_port_fanout_number 3 [get_ports {dbg_awcache_s0}]
set_load -pin_load 3 [get_ports {dbg_awprot_s0}]
set_port_fanout_number 3 [get_ports {dbg_awprot_s0}]
set_load -pin_load 3 [get_ports {dbg_awvalid_s0}]
set_port_fanout_number 3 [get_ports {dbg_awvalid_s0}]
set_load -pin_load 3 [get_ports {dbg_awready_s0}]
set_port_fanout_number 3 [get_ports {dbg_awready_s0}]
set_load -pin_load 3 [get_ports {dbg_wid_s0}]
set_port_fanout_number 3 [get_ports {dbg_wid_s0}]
set_load -pin_load 3 [get_ports {dbg_wdata_s0}]
set_port_fanout_number 3 [get_ports {dbg_wdata_s0}]
set_load -pin_load 3 [get_ports {dbg_wstrb_s0}]
set_port_fanout_number 3 [get_ports {dbg_wstrb_s0}]
set_load -pin_load 3 [get_ports {dbg_wlast_s0}]
set_port_fanout_number 3 [get_ports {dbg_wlast_s0}]
set_load -pin_load 3 [get_ports {dbg_wvalid_s0}]
set_port_fanout_number 3 [get_ports {dbg_wvalid_s0}]
set_load -pin_load 3 [get_ports {dbg_wready_s0}]
set_port_fanout_number 3 [get_ports {dbg_wready_s0}]
set_load -pin_load 3 [get_ports {dbg_bid_s0}]
set_port_fanout_number 3 [get_ports {dbg_bid_s0}]
set_load -pin_load 3 [get_ports {dbg_bresp_s0}]
set_port_fanout_number 3 [get_ports {dbg_bresp_s0}]
set_load -pin_load 3 [get_ports {dbg_bvalid_s0}]
set_port_fanout_number 3 [get_ports {dbg_bvalid_s0}]
set_load -pin_load 3 [get_ports {dbg_bready_s0}]
set_port_fanout_number 3 [get_ports {dbg_bready_s0}]
set_load -pin_load 3 [get_ports {dbg_arid_s0}]
set_port_fanout_number 3 [get_ports {dbg_arid_s0}]
set_load -pin_load 3 [get_ports {dbg_araddr_s0}]
set_port_fanout_number 3 [get_ports {dbg_araddr_s0}]
set_load -pin_load 3 [get_ports {dbg_arlen_s0}]
set_port_fanout_number 3 [get_ports {dbg_arlen_s0}]
set_load -pin_load 3 [get_ports {dbg_arsize_s0}]
set_port_fanout_number 3 [get_ports {dbg_arsize_s0}]
set_load -pin_load 3 [get_ports {dbg_arburst_s0}]
set_port_fanout_number 3 [get_ports {dbg_arburst_s0}]
set_load -pin_load 3 [get_ports {dbg_arlock_s0}]
set_port_fanout_number 3 [get_ports {dbg_arlock_s0}]
set_load -pin_load 3 [get_ports {dbg_arcache_s0}]
set_port_fanout_number 3 [get_ports {dbg_arcache_s0}]
set_load -pin_load 3 [get_ports {dbg_arprot_s0}]
set_port_fanout_number 3 [get_ports {dbg_arprot_s0}]
set_load -pin_load 3 [get_ports {dbg_arvalid_s0}]
set_port_fanout_number 3 [get_ports {dbg_arvalid_s0}]
set_load -pin_load 3 [get_ports {dbg_arready_s0}]
set_port_fanout_number 3 [get_ports {dbg_arready_s0}]
set_load -pin_load 3 [get_ports {dbg_rid_s0}]
set_port_fanout_number 3 [get_ports {dbg_rid_s0}]
set_load -pin_load 3 [get_ports {dbg_rdata_s0}]
set_port_fanout_number 3 [get_ports {dbg_rdata_s0}]
set_load -pin_load 3 [get_ports {dbg_rresp_s0}]
set_port_fanout_number 3 [get_ports {dbg_rresp_s0}]
set_load -pin_load 3 [get_ports {dbg_rvalid_s0}]
set_port_fanout_number 3 [get_ports {dbg_rvalid_s0}]
set_load -pin_load 3 [get_ports {dbg_rlast_s0}]
set_port_fanout_number 3 [get_ports {dbg_rlast_s0}]
set_load -pin_load 3 [get_ports {dbg_rready_s0}]
set_port_fanout_number 3 [get_ports {dbg_rready_s0}]
# Assume the following drive cells for input ports.
set_driving_cell [get_ports {aresetn}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awvalid_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awaddr_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awid_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awlen_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awsize_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awburst_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awlock_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awcache_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awprot_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wvalid_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wid_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wdata_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wstrb_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wlast_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bready_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arvalid_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arid_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {araddr_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arlen_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arsize_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arburst_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arlock_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arcache_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arprot_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rready_m1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s1}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s2}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s3}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s4}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s5}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s6}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {awready_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {wready_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bvalid_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bid_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {bresp_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {arready_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rvalid_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rid_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rdata_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rresp_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {rlast_s7}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule
set_driving_cell [get_ports {remap_n}] -library default_technology -lib_cell FD1 -pin Q -no_design_rule

